{"dialogue": "Doctor: What brings you in today?\nPatient: I've had a sore throat for 3 days, hurts when swallowing.\nDoctor: Fever?\nPatient: 100.4 yesterday.\nDoctor: Cough or congestion?\nPatient: Slight congestion, no cough.\nDoctor: Sick contacts?\nPatient: My sister had a cold last week.", "soap": "S: Patient reports 3-day history of sore throat worsened by swallowing, mild congestion, and subjective fever up to 100.4°F. Recent sick contact with sister who had a cold.\nO: Mild fever reported, no cough. No airway difficulty or systemic symptoms mentioned.\nA: Likely viral pharyngitis. Differentials: streptococcal pharyngitis, allergic rhinitis.\nP: Recommend hydration, NSAIDs for pain/fever, throat lozenges, rest. Return if fever persists >3 days, difficulty breathing, drooling, or worsening pain."}
{"dialogue": "Patient: My left eye keeps twitching randomly.\nDoctor: How long has this been happening?\nPatient: About two weeks. Mostly when I'm stressed or tired.\nDoctor: Any vision changes?\nPatient: No, vision is normal.\nDoctor: Caffeine intake?\nPatient: 4 coffees a day.", "soap": "S: Patient reports 2-week history of intermittent left eyelid twitching, triggered by stress and fatigue. Denies visual changes.\nO: No reported neurological deficits or visual disturbance.\nA: Likely eyelid myokymia. Differentials: electrolyte imbalance, benign essential blepharospasm.\nP: Reduce caffeine intake, improve sleep hygiene, monitor symptoms. Return if twitching spreads, vision changes, or weakness develops."}
{"dialogue": "Doctor: Tell me about the headaches.\nPatient: Started 6 months ago, pressure behind my eyes.\nDoctor: Frequency?\nPatient: 3–4 times a week.\nDoctor: Triggers?\nPatient: Screens and stress.\nDoctor: Any nausea or vision changes?\nPatient: No.", "soap": "S: Patient reports 6-month history of headaches 3–4 times weekly, described as pressure behind the eyes, triggered by screen exposure and stress. No associated nausea or visual changes.\nO: No reported neurological deficits or red-flag symptoms.\nA: Likely tension-type headache. Differentials: migraine without aura, sinus headache.\nP: Recommend screen breaks, hydration, stress management, NSAIDs as needed. Consider headache diary. Follow-up if worsening or neurological symptoms develop."}
{"dialogue": "Patient: I've been coughing for a week.\nDoctor: Dry or productive?\nPatient: Dry.\nDoctor: Fever?\nPatient: None.\nDoctor: Shortness of breath?\nPatient: No.\nDoctor: Smoking history?\nPatient: Never.", "soap": "S: Patient reports 1-week history of dry cough without fever or dyspnea. No smoking history.\nO: No systemic symptoms or respiratory distress noted.\nA: Likely post-viral cough. Differentials: allergic cough, GERD-related cough.\nP: Reassurance, hydration, honey/lozenges, avoid irritants. Return if cough lasts >3 weeks, fever, or breathing difficulty develops."}
{"dialogue": "Doctor: What brings you in?\nPatient: My right knee hurts when I climb stairs.\nDoctor: When did it start?\nPatient: About a month ago.\nDoctor: Trauma?\nPatient: No injury.\nDoctor: Swelling?\nPatient: Mild after long walks.", "soap": "S: Patient reports 1-month history of right knee pain aggravated by stairs and prolonged walking, with mild swelling. No trauma.\nO: No instability, locking, or systemic symptoms reported.\nA: Suspected patellofemoral pain syndrome. Differentials: early osteoarthritis, meniscal irritation.\nP: Recommend activity modification, NSAIDs as needed, quadriceps strengthening, ice after activity. Follow-up if worsening."}
{"dialogue": "Patient: I feel short of breath when exercising.\nDoctor: How long has this been happening?\nPatient: About 2 months.\nDoctor: Chest pain?\nPatient: No.\nDoctor: Smoking?\nPatient: No.\nDoctor: Asthma history?\nPatient: Had mild asthma as a kid.", "soap": "S: Patient reports 2-month history of exertional shortness of breath. No chest pain. Childhood history of mild asthma.\nO: No acute respiratory distress reported.\nA: Possible exercise-induced bronchoconstriction. Differentials: deconditioning, anemia.\nP: Recommend spirometry, trial short-acting bronchodilator before exercise, assess fitness level, follow-up after testing."}
{"dialogue": "Doctor: What happened?\nPatient: I twisted my ankle yesterday while running.\nDoctor: Able to walk?\nPatient: Yes, but painful.\nDoctor: Swelling?\nPatient: A little.", "soap": "S: Patient reports acute right ankle pain after twisting injury yesterday, able to bear weight with discomfort, mild swelling present.\nO: No numbness, weakness, or deformity reported.\nA: Likely lateral ankle sprain. Differentials: fracture, tendon strain.\nP: RICE therapy, NSAIDs, gradual weight bearing, consider X-ray if pain persists or inability to walk develops."}
{"dialogue": "Patient: My stomach burns after eating spicy food.\nDoctor: How long?\nPatient: 3 weeks.\nDoctor: Nausea or vomiting?\nPatient: No.\nDoctor: Alcohol?\nPatient: Occasionally.", "soap": "S: Patient reports 3-week history of burning epigastric discomfort after spicy meals. No nausea or vomiting.\nO: No alarming GI symptoms reported.\nA: Likely gastritis or acid reflux. Differentials: peptic ulcer disease, functional dyspepsia.\nP: Avoid triggers, trial antacid/PPI, limit alcohol, follow-up if persistent or worsening."}
{"dialogue": "Doctor: What's going on?\nPatient: I'm exhausted all the time.\nDoctor: How long?\nPatient: About 2 months.\nDoctor: Sleep?\nPatient: 5 hours a night.\nDoctor: Diet?\nPatient: Mostly takeout.", "soap": "S: Patient reports 2-month history of persistent fatigue, sleeping 5 hours nightly, poor diet. No other associated symptoms mentioned.\nO: No reported weight loss, fever, or neurological symptoms.\nA: Suspected inadequate sleep and nutrition. Differentials: anemia, hypothyroidism.\nP: Improve sleep hygiene, balanced diet, consider CBC and TSH screening. Follow-up in 4 weeks."}
{"dialogue": "Patient: My back hurts after long hours at my desk.\nDoctor: Duration?\nPatient: 4 months.\nDoctor: Radiation down legs?\nPatient: No.\nDoctor: Exercise?\nPatient: Rarely.", "soap": "S: Patient reports 4-month history of low back pain associated with prolonged sitting. Denies leg numbness or radiation.\nO: No neurological deficits reported.\nA: Likely mechanical low back pain. Differentials: muscle strain, early degenerative disc disease.\nP: Recommend posture correction, stretching, ergonomic adjustments, NSAIDs as needed, gradual exercise program."}
{"dialogue": "Doctor: Why are you here today?\nPatient: My heart sometimes feels like it's skipping a beat.\nDoctor: How often?\nPatient: A few times a day for the past week.\nDoctor: Chest pain?\nPatient: No.\nDoctor: Caffeine?\nPatient: Energy drinks daily.", "soap": "S: Patient reports 1-week history of intermittent palpitations occurring several times daily, associated with frequent energy drink consumption. Denies chest pain.\nO: No syncope, dizziness, or dyspnea reported.\nA: Suspected benign premature beats. Differentials: electrolyte imbalance, supraventricular ectopy.\nP: Reduce caffeine intake, hydration, consider ECG if persistent. Return sooner if chest pain, fainting, or worsening symptoms."}
{"dialogue": "Patient: My skin gets itchy after hot showers.\nDoctor: Any rash?\nPatient: Slight redness.\nDoctor: New soaps or detergents?\nPatient: No.\nDoctor: History of eczema?\nPatient: Yes, mild as a kid.", "soap": "S: Patient reports itchiness and mild redness after hot showers. History of childhood eczema.\nO: No open lesions or systemic symptoms reported.\nA: Likely xerotic dermatitis. Differentials: mild eczema flare, contact dermatitis.\nP: Recommend lukewarm showers, fragrance-free moisturizer, avoid irritants. Consider topical steroid if persistent."}
{"dialogue": "Doctor: Tell me about the dizziness.\nPatient: Happens when I stand up fast.\nDoctor: How long?\nPatient: 3 weeks.\nDoctor: Fainting?\nPatient: No.", "soap": "S: Patient reports 3-week history of dizziness upon standing, brief duration, no syncope.\nO: No chest pain, palpitations, or neurological deficits reported.\nA: Likely orthostatic lightheadedness. Differentials: dehydration, anemia.\nP: Increase fluids, rise slowly from sitting, consider BP check and CBC if persistent."}
{"dialogue": "Patient: My ears feel clogged.\nDoctor: Pain?\nPatient: No.\nDoctor: Hearing loss?\nPatient: Slight.\nDoctor: Swimming?\nPatient: Yes, daily.", "soap": "S: Patient reports clogged ears with mild hearing decrease, recent frequent swimming. No pain.\nO: No fever or discharge reported.\nA: Possible cerumen impaction or otitis externa. Differentials: eustachian tube dysfunction.\nP: Recommend ear exam, avoid Q-tips, consider ear drops if external irritation present."}
{"dialogue": "Doctor: What seems to be the issue?\nPatient: My hands shake when I'm anxious.\nDoctor: Resting tremor?\nPatient: No, only when nervous.\nDoctor: Caffeine?\nPatient: 3 cups daily.", "soap": "S: Patient reports intermittent hand tremors during anxiety-provoking situations. No resting tremor. Moderate caffeine intake.\nO: No neurological deficits reported.\nA: Likely physiologic tremor triggered by anxiety. Differentials: caffeine-related tremor, essential tremor.\nP: Reduce caffeine, stress management, monitor symptoms. Follow-up if persistent or worsening."}
